import React from "react";

function AboutBiography() {
  return (
    <>
      <p>
        Я являюсь Разработчиком программного обеспечения. Мой творческий путь
        начался в далеком 2010 года, был сильно заинтересован системным
        администрирование, занимался сборкой и ремонтом компьютеров (практикую и
        в настоящий момент). После углубления в сферу IT, заинтересовался
        программированием, проходил различный online курсы от
        <a href="https://htmlacademy.ru/">
          <b>
            <i> html academy </i>
          </b>
        </a>
        и online платформы
        <a href="https://www.sololearn.com">
          <b>
            <i> sololearn </i>
          </b>
        </a>
        (курсы по C#, PHP, SQL, C++, JavaScript).
      </p>
      <p>
        В дальнейшем поступил на курсы разработки программного обеспечения на
        языке JAVA в <b>Национальный университет г. Донецка</b>, кафедра{" "}
        <b>«Компьютерные технологии»</b>. После занимался частной практикой.
      </p>
      <p>
        Поступил в высшее учебное заведение
        <b> Компьютерную академию ШАГ г. Донецка </b>, по специализации
        <b> «Разработка ПО» </b>. В процессе обучения познакомился с разними
        языками программирования, научился разрабатывать:
      </p>

      <ul>
        <li>
          Консольные приложения на языке <b>С++</b> с использованием библиотеки
          классов
          <b>STL.</b>
        </li>
        <li>
          Освоил различные паттерны проектирования ( <b>MVC, MVVM, и другие</b>)
        </li>
        <li>
          Системное программирование на <b>С#</b>, с применением технологий
          <b> Windows Forms, WPF.</b>
        </li>
        <li>
          Освоил технологии доступа к базам данных <b>ADO.NET.</b>{" "}
        </li>
        <li>
          Программирование и администрирование БД ( <b>MySQL, MsSQL</b>).{" "}
        </li>
        <li>
          Изучил базовый курс по <b></b>, и в дальнейшем framework <b></b>
          «LARAVEL»
        </li>
        <li>
          Создание web–приложений, исполняемых на стороне сервера с помощью
          языка программирования<b></b> PHP и технологии <b></b>AJAX.
        </li>
        <li>
          Разработка web-приложений <b></b>ASP.NET на языке <b></b>C# с
          применением <b></b>СУБД MS SQL Server, источников данных XML и
          технологии AJAX
        </li>
        <li>
          Разработка приложений для мобильных устройств на основе операционной
          системы <b></b>Android
        </li>
      </ul>

      <p>
        Все изученные языки и технологии подкреплены многими часами практики.
      </p>
      <p>
        Мною были спроектированы и разработаны несколько ПО для Windows из них:
      </p>
      <ul>
        <li>
          Система управления «Умный дом» ( С#, Windows Forms, MVC, Locale Data
          Base)
        </li>
        <li>
          Приложение для станции «Тех. обслуживания» (C#, WPF, MVC, Locale Data
          Base, MySQL)
        </li>
        <li>
          Приложения для учета книг в библиотеке «Library» (С#, WPF, MySQL, MVC)
          .
        </li>
        <li>И другие …. </li>
      </ul>
      <p>
        После многочисленных изучения языков и технологий, выбрал для себя
        направление Web разработки, углубился в изучении «трех китов»
        JAVASCRIPT, HTML, CSS.
      </p>
      <p>
        Мой первый Production опыт был на заказ в стеке Angular/TypeScript, было
        реализовано полноценное fullStack web приложение для «Авто сервиса»:
      </p>
      <ul>
        <li>back - node.js, express, mySQL</li>
        <li>front - angular, typeScript</li>
      </ul>
      <p>
        Поддержка сайта местной компании по доставке еды( стек Vue + Cordova +
        Framework 7 )
      </p>
    </>
  );
}

export default AboutBiography;
